Tekla Open API Reference for Tekla Structures 2025
ModifiedObjectInfo.ModelObject Field
 Gets the object modified.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public readonly ModelObject ModelObject
Public ReadOnly ModelObject As ModelObject
Field Value
Type: ModelObject
 The object modified.
See Also
Reference
ModifiedObjectInfo Structure
Tekla.Structures.Model.History Namespace